<!-- dflook/terraform-github-actions {"workspace":"workflows","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"f7a11bee77e70ca73a2160e864972d51ef7228d8663bbe3d6737d00144482635","plan_job_ref":"Job Test actions using target and replace #433 at https://github.com/dflook/terraform-github-actions/actions/runs/12444880281","plan_hash":"25be272a35b32706e6685f77d5c81e7845800c40f357d5ddc0ae9dba325698b6","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __workflows__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] must be replaced
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      length      = 10 -> 6 # forces replacement
!~      result      = "**********" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  foreach = "NaG176LhIo" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test actions using target and replace #433](https://github.com/dflook/terraform-github-actions/actions/runs/12444880281)